api/app/mailers/user_mailer.rb

SELECT "users".* FROM "users" WHERE "users"."admin" = $1  [["admin", true]]
---
  def new_member_notification(user)
    @user = user
    @admins = User.where(admin: true)