app/controllers/pages_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT $1  [["LIMIT", 4]]
---
    def home
        @articles = Article.last(4).reverse