app/controllers/rooms_controller.rb

    def destroy
        @room = Room.find(params[:id]) if params[:id]
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 123], ["LIMIT", 1]]

        def load_entities
            @rooms = Room.all
            @room = Room.friendly.find(params[:id]) if params[:id]
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 123], ["LIMIT", 1]]