api/app/controllers/api/v1/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" IN ($1, $2, $3, $4, $5, $6)  [[nil, 6], [nil, 5], [nil, 4], [nil, 3], [nil, 2], [nil, 1]]
---
      def index
        @articles = Article.includes(:comments).order(created_at: :desc)

INSERT INTO "articles" ("title", "content", "created_at", "updated_at", "user_id", "slug") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "hi"], ["content", "weeeeejutfjthhhghg"], ["created_at", "2024-06-25 20:54:17.047545"], ["updated_at", "2024-06-25 20:54:17.047545"], ["user_id", 1], ["slug", "hi"]]
---
      def create
        article = Article.create!(article_params)

UPDATE "articles" SET "updated_at" = $1, "image" = $2 WHERE "articles"."id" = $3  [["updated_at", "2024-08-23 12:37:28.575268"], ["image", "download.jpeg"], ["id", 1]]
---
      def upload_image
        if article.update(image_params)

UPDATE "articles" SET "title" = $1, "content" = $2, "updated_at" = $3, "pinned" = $4 WHERE "articles"."id" = $5  [["title", "hi updated"], ["content", "weeeeejutfjthhhghg updated"], ["updated_at", "2024-10-18 18:54:06.770540"], ["pinned", true], ["id", 2]]
---
      def update
        if article.update(article_params)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 6]]
---
      def article
        @article ||= Article.includes(:comments).find(params[:id])