api/app/controllers/api/v1/authentications_controller.rb

      def login
        @user = User.find_by(email: params[:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@gmail.com"], ["LIMIT", 1]]

      def signup
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at", "confirm_token", "phone_number", "firstname", "lastname", "slug") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"