api/app/controllers/api/v1/cabins_controller.rb

UPDATE "cabins" SET "name" = $1, "updated_at" = $2, "washerdryer" = $3, "description" = $4 WHERE "cabins"."id" = $5  [["name", "test_cabin - updated"], ["updated_at", "2024-10-18 18:55:38.822667"], ["washerdryer", false], ["description", "foobar - updated"], ["id", 1]]
---
      def update
        if cabin.update(cabin_params)

SELECT "cabindates".* FROM "cabindates" WHERE "cabindates"."cabin_id" = $1  [["cabin_id", 1]]
---
      def cabin
        @cabin ||= Cabin.includes(:cabin_attachments, :cabindates).find_by_id(params[:id])