api/app/controllers/api/v1/cabins_controller.rb

            def index
                @cabins = Cabin.all
---
SELECT "cabins".* FROM "cabins"

            def create
                @cabin = current_user.cabins.build(cabin_params)
                respond_to do |format|
                    if @cabin.save
---
INSERT INTO "cabins" ("name", "bedrooms", "created_at", "updated_at", "user_id", "washerdryer", "dock", "description", "price_per_week", "price_per_day") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

            def show
                set_cabin
                return unless @cabin

                @cabin_attachments = @cabin.cabin_attachments.all
---
SELECT "cabin_attachments".* FROM "cabin_attachments" WHERE "cabin_attachments"."cabin_id" = $1  [["cabin_id", 1]]

            def update
                if current_user.admin?
                    set_cabin
                else
                    @cabin = current_user.cabins.find(params[:id])
                end
                respond_to do |format|
                    if @cabin.update(cabin_params)
                    if params[:cabin_attachments]
                        params[:cabin_attachments]['image'].each do |i|
---
SELECT "cabins".* FROM "cabins" WHERE "cabins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cabins" SET "name" = $1, "updated_at" = $2, "washerdryer" = $3, "description" = $4 WHERE "cabins"."id" = $5  [["name", "test_cabin - updated"], ["updated_at", "2024-10-18 18:55:38.822667"], ["washerdryer", false], ["description", "foobar - updated"], ["id", 1]]
SELECT "cabin_attachments".* FROM "cabin_attachments" WHERE "cabin_attachments"."cabin_id" = $1  [["cabin_id", 1]]

            def set_cabin
                @cabin = Cabin.find_by_id(params[:id])
---
SELECT "cabins".* FROM "cabins" WHERE "cabins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]