api/app/controllers/api/v1/cabin_dates_controller.rb

SELECT "cabindates".* FROM "cabindates" WHERE "cabindates"."cabin_id" = $1 LIMIT $2  [["cabin_id", 1], ["LIMIT", 1]]
---
      def index
        @cabin_dates = Cabindate.find_by(id: params[:cabin_id])

INSERT INTO "cabindates" ("startdate", "enddate", "cabin_id") VALUES ($1, $2, $3) RETURNING "id"  [["startdate", "2020-01-01"], ["enddate", "2020-01-02"], ["cabin_id", 1]]
---
      def create
        @cabin_date = Cabindate.create!(cabin_date_params)