api/app/controllers/api/v1/cabin_attachments_controller.rb

            def index
                @cabin_attachments = CabinAttachment.all
---
SELECT "cabin_attachments".* FROM "cabin_attachments" WHERE "cabin_attachments"."cabin_id" = $1 LIMIT $2  [["cabin_id", 1], ["LIMIT", 1]]

            def create
                @cabin_attachment = CabinAttachment.new(cabin_attachment_params)

                respond_to do |format|
                    if @cabin_attachment.save
---
INSERT INTO "cabin_attachments" ("cabin_id", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cabin_id", 1], ["image", "download.jpeg"], ["created_at", "2024-08-23 11:16:25.954702"], ["updated_at", "2024-08-23 11:16:25.954702"]]

            def set_cabin_attachment
                @cabin_attachment = CabinAttachment.find(params[:id])
---
SELECT "cabin_attachments".* FROM "cabin_attachments" WHERE "cabin_attachments"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]