api/app/controllers/api/v1/cabin_dates_controller.rb

            def new
                @cabindate = Cabindate.new(cabin_id: params[:cabin_id])
                @cabin = Cabin.find(params[:cabin_id])
---
SELECT "cabins".* FROM "cabins" WHERE "cabins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]