api/app/controllers/api/v1/charts_controller.rb

SELECT "charts".* FROM "charts"
---
      def index
        chart = Chart.all

INSERT INTO "charts" ("chart", "caption", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["chart", "fells_loop.gpx"], ["caption", "undefined"], ["user_id", 1], ["created_at", "2024-10-17 02:25:46.282719"], ["updated_at", "2024-10-17 02:25:46.282719"]]
SELECT "charts".* FROM "charts"
---
      def create
        @chart = Chart.create!(charts_params)
        render json: Chart.all

SELECT "charts".* FROM "charts" WHERE "charts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
      def show
        chart = Chart.find(params[:id])

DELETE FROM "charts" WHERE "charts"."id" = $1  [["id", 2]]
---
      def destroy
        set_chart
        if @chart.destroy

SELECT "charts".* FROM "charts" WHERE "charts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
      def set_chart
        @chart = Chart.find(params[:id])