api/app/controllers/api/v1/charts_controller.rb

SELECT "charts".* FROM "charts"
---
      def destroy
        set_chart
        render json: Chart.all