api/app/controllers/api/v1/comments_controller.rb

            def new
                session[:user_id]
                @comment = Comment.new(article_id: params[:article_id])
                @article = Article.find(params[:article_id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

            def create
                @comment = Comment.new(comment_params)
                @comment.user_id = session[:user_id]
                @articleid = params[:article_id]
                if @comment.save
---
INSERT INTO "comments" ("content", "created_at", "updated_at", "user_id", "article_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Comment Test"], ["created_at", "2024-08-23 12:15:44.500771"], ["updated_at", "2024-08-23 12:15:44.500771"], ["user_id", 1], ["article_id", 6]]

            def destroy
                @comment = Comment.find(params[:id])
                if @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 6]]