api/app/controllers/api/v1/committees_controller.rb

SELECT "committees".* FROM "committees"
---
      def index
        committee = Committee.all