api/app/controllers/api/v1/entry_controller.rb

      def recent_articles
        @articles = Article.last(4).reverse
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT $1  [["LIMIT", 4]]

      def this_weeks_events
        nearest_sunday = Time.now.sunday.to_s
        last_sunday = Time.now.last_week.sunday.to_s

        @events = Event.where(
          :start_time.to_s => last_sunday..nearest_sunday
        )
---
SELECT "events".* FROM "events" WHERE "events"."start_time" BETWEEN $1 AND $2  [["start_time", "2024-03-03"], ["start_time", "2024-03-10"]]