api/app/controllers/api/v1/entry_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT $1  [["LIMIT", 4]]
---
      def initial_payload
        # campers
        campers = []
        html_as_s = URI.open('https://www.pronto2.com/icfc/bookingslist.php').read
        doc = Nokogiri::HTML(html_as_s)
        table = doc.css('tr')
        table.each do |table_row|
          camper = {
            name: table_row.css('td:nth-of-type(1)').text,
            arrival: table_row.css('td:nth-of-type(2)').text,
            departure: table_row.css('td:nth-of-type(3)').text
          }
          campers.append(camper)
        end

        # articles
        articles = Article.last(4).reverse