api/app/controllers/api/v1/events_controller.rb

SELECT "events".* FROM "events"
---
            def index
                @events = Event.all
                @events_by_date = Event.all.group_by(&:start_time)

INSERT INTO "events" ("events", "location", "start_time", "end_time", "description", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["events", "foobar"], ["location", "park"], ["start_time", "2024-10-16"], ["end_time", "2024-10-17"], ["description", "foobar"], ["user_id", 1]]
---
            def create
                @event = current_user.events.new(event_params)
                respond_to do |format|
                    if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "events" = $1, "location" = $2, "end_time" = $3, "description" = $4 WHERE "events"."id" = $5  [["events", "foobar - updated"], ["location", "Seattle, WA - updated"], ["end_time", "2024-09-29"], ["description", "foobar - updated"], ["id", 1]]
---
            def update
                if current_user.admin?
                    set_event
                else
                    @event = current_user.events.find(params[:id])
                end
                respond_to do |format|
                    if @event.update(event_params)

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
            def set_event
                @event = Event.find_by_id(params[:id])