api/app/controllers/api/v1/family_members_controller.rb

INSERT INTO "family_members" ("name", "relationship", "family_tree_id", "parent_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Diehl"], ["relationship", 4], ["family_tree_id", 1], ["parent_id", 0], ["created_at", "2024-08-23 14:44:04.839110"], ["updated_at", "2024-08-23 14:44:04.839110"]]
---
      def create
        @family_member = FamilyMember.new(family_member_params)
        if @family_member.save