api/app/controllers/api/v1/family_trees_controller.rb

SELECT "family_trees".* FROM "family_trees"
---
      def index
        @family_trees = FamilyTree.all

SELECT "family_members".* FROM "family_members" WHERE "family_members"."family_tree_id" = $1  [["family_tree_id", 1]]
SELECT "family_trees".* FROM "family_trees" WHERE "family_trees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def show
        @family_tree = FamilyTree.includes(:family_members).find(params[:id])

INSERT INTO "family_trees" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Sillers"], ["created_at", "2024-10-18 18:12:21.305705"], ["updated_at", "2024-10-18 18:12:21.305705"], ["user_id", 1]]
---
      def create
        @family_tree = FamilyTree.new(family_tree_params)
        if @family_tree.save

SELECT "family_trees".* FROM "family_trees" WHERE "family_trees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "family_trees" WHERE "family_trees"."id" = $1  [["id", 1]]
---
      def destroy
        @family_tree = FamilyTree.find(params[:id])
        if @family_tree.destroy