api/app/controllers/api/v1/family_members_controller.rb

      def create
        family_members_data = params.permit!.to_h

        family_members_data['_json'].each do |family_member_data|
          # Find by unique identifier (assuming `name` is unique)
          family_member = FamilyMember.find_or_initialize_by(name: family_member_data[:name])

          family_member.assign_attributes(
            relationship: family_member_data[:relationship],
            family_tree_id: family_member_data[:family_tree_id]
          )

          # Save the record only if it is new or has changes
          next unless family_member.changed? && !family_member.save
---
SELECT "family_members".* FROM "family_members" WHERE "family_members"."name" = $1 LIMIT $2  [["name", "Elise"], ["LIMIT", 1]]
UPDATE "family_members" SET "family_tree_id" = $1, "updated_at" = $2 WHERE "family_members"."id" = $3  [["family_tree_id", 2], ["updated_at", "2024-09-27 17:34:21.981867"], ["id", 4]]

      def update
        relationships = params.permit!.to_h

        # Loop through each relationship (each hash in the array)
        relationships['_json'].each do |relationship|
          child_id = relationship['child']
          parent_id = relationship['parent']

          child = FamilyMember.find_by_id(child_id)
          parent = FamilyMember.find_by_id(parent_id)

          render json: { error: 'Child or Parent not found' }, status: :not_found && return if child.nil? || parent.nil?

          child.parent_ids = [] unless child.parent_ids

          # Ensure that the child has at most two parents
          if child.parent_ids.count >= 2 && !child.parent_ids.include?(parent.id)
            render json: { error: "#{child.name} already has two parents" }, status: :unprocessable_entity && return
          end

          # Append the new parent to the parent_ids array without affecting existing relationships
          new_parent_ids = (child.parent_ids << parent.id).uniq
          child.update!(parent_ids: new_parent_ids)
---
SELECT "family_members".* FROM "family_members" WHERE "family_members"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "family_members".* FROM "family_members" WHERE "family_members"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "family_members".* FROM "family_members" LIMIT $1  [["LIMIT", 1]]
UPDATE "family_members" SET "updated_at" = $1, "parent_ids" = $2 WHERE "family_members"."id" = $3  [["updated_at", "2024-09-27 17:34:51.956844"], ["parent_ids", "{10}"], ["id", 4]]