api/app/controllers/api/v1/galleries_controller.rb

            def create
                @gallery = current_user.galleries.new(galleries_params)
                if @gallery.save
---
INSERT INTO "galleries" ("image", "caption", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["image", "download.jpeg"], ["caption", "Hello Image"], ["user_id", 1], ["created_at", "2024-08-21 14:48:31.459983"], ["updated_at", "2024-08-21 14:48:31.459983"]]

            def index
                @gallery = Gallery.new
                @galleries = Gallery.paginate(page: params[:page])
---
SELECT "galleries".* FROM "galleries" LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]

            def destroy
                set_gallery
                if @gallery.destroy
---
DELETE FROM "galleries" WHERE "galleries"."id" = $1  [["id", 20]]

            def set_gallery
                @gallery = Gallery.find(params[:id])
---
SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]