api/app/controllers/api/v1/location_points_controller.rb

      def index
        location_point = LocationPoint.all
---
SELECT "location_points".* FROM "location_points"

      def create
        @location_point = LocationPoint.create!(location_point_params)
        render json: LocationPoint.all
---
INSERT INTO "location_points" ("location_name", "location_description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["location_name", "Toronto Airport"], ["location_description", "Toronto Airport"], ["created_at", "2024-08-20 10:10:39.568680"], ["updated_at", "2024-08-20 10:10:39.568680"]]
SELECT "location_points".* FROM "location_points"

      def set_location_point
        @location = LocationPoint.find(params[:id])
---
SELECT "location_points".* FROM "location_points" WHERE "location_points"."id" = $1  [["id", "62bd9e52-0c63-4cbe-a763-0a511efb02be"]]