api/app/controllers/api/v1/rideshares_controller.rb

SELECT "rideshares".* FROM "rideshares" WHERE (arriving_at > '2024-06-17')
---
      def index
        rideshare = Rideshare.includes(:point_of_departure, :point_of_arrival).all.where('arriving_at > ?', Date.today)

INSERT INTO "rideshares" ("departing_at", "arriving_at", "number_of_passengers", "additional_information", "created_at", "updated_at", "point_of_arrival_id", "point_of_departure_id", "user_id", "seeking") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT "rideshares".* FROM "rideshares"
---
      def create
        @rideshare = Rideshare.create!(rideshare_params)
        if @rideshare.save
          render json: Rideshare.all

SELECT "rideshares".* FROM "rideshares" WHERE "rideshares"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
      def show
        rideshare = Rideshare.includes(:point_of_departure, :point_of_arrival).find(params[:id])

DELETE FROM "rideshares" WHERE "rideshares"."id" = $1  [["id", "dd6649f4-cdc5-49e3-b24f-3ec3bc390ef1"]]
---
      def destroy
        set_rideshare
        if @rideshare.destroy

SELECT "rideshares".* FROM "rideshares" WHERE "rideshares"."id" = $1 LIMIT $2  [["id", "dd6649f4-cdc5-49e3-b24f-3ec3bc390ef1"], ["LIMIT", 1]]
---
      def set_rideshare
        @rideshare = Rideshare.find(params[:id])