api/app/controllers/api/v1/search_controller.rb

SELECT "articles".* FROM "articles" WHERE (lower(title) LIKE '%foo%' OR lower(content) LIKE '%foo%')
SELECT "cabins".* FROM "cabins" WHERE (lower(name) LIKE '%foo%' OR lower(description) LIKE '%foo%')
SELECT "users".* FROM "users" WHERE (lower(firstname) LIKE '%foo%' OR lower(lastname) LIKE '%foo%' OR lower(username) LIKE '%foo%')
SELECT "events".* FROM "events" WHERE (lower(events) LIKE '%foo' OR lower(description) LIKE '%foo%')
---
      def search
        return unless params[:search]

        @articles = Article.where('lower(title) LIKE ? OR lower(content) LIKE ?', "%#{params[:search].downcase}%",
                                  "%#{params[:search].downcase}%")
        @cabins = Cabin.where('lower(name) LIKE ? OR lower(description) LIKE ?', "%#{params[:search].downcase}%",
                              "%#{params[:search].downcase}%")
        @users = User.where('lower(firstname) LIKE ? OR lower(lastname) LIKE ? OR lower(username) LIKE ?',
                            "%#{params[:search].downcase}%", "%#{params[:search].downcase}%",
                            "%#{params[:search].downcase}%")
        @events = Event.where('lower(events) LIKE ? OR lower(description) LIKE ?', "%#{params[:search].downcase}",
                              "%#{params[:search].downcase}%")