api/app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users"
---
      def index
        user = User.except(
          :password,
          :password_digest,
          :password_confirmation,
          :password_reset_token,
          :admin
        ).all

SELECT "users"."id", "users"."admin", "users"."email", "users"."firstname", "users"."lastname", "users"."phone_number", "users"."username" FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def show
        user_to_return = User.select(
          'id',
          'admin',
          'email',
          'firstname',
          'lastname',
          'phone_number',
          'username',
          'username'
        ).find(params[:id])