api/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."slug" = $1 LIMIT $2  [["slug", "123"], ["LIMIT", 1]]
---
  def set_article
    @article = Article.find_by(slug: params[:id])