api/app/controllers/cabins_controller.rb

SELECT "cabins".* FROM "cabins" WHERE "cabins"."id" = $1 LIMIT $2  [["id", 123], ["LIMIT", 1]]
---
  def set_cabin
    @cabin = Cabin.find(params[:id])