api/app/controllers/cabin_attachments_controller.rb

  def destroy
    @attachment = @cabin.cabin_attachments.find(params[:id])
---
SELECT "cabin_attachments".* FROM "cabin_attachments" WHERE "cabin_attachments"."id" = $1 LIMIT $2  [["id", 123], ["LIMIT", 1]]