api/app/controllers/password_resets_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "diehlstx@gmail.com"], ["LIMIT", 1]]
---
  def create
    @user = User.find_by(email: params[:email]&.downcase)

SELECT "users".* FROM "users" WHERE "users"."password_reset_token" = $1 LIMIT $2  [["password_reset_token", "nQVQsnHOFYqec-X2MXyHWA"], ["LIMIT", 1]]
---
  def edit
    @user = User.find_by(password_reset_token: params[:token])

SELECT "users".* FROM "users" WHERE "users"."password_reset_token" = $1 LIMIT $2  [["password_reset_token", "nQVQsnHOFYqec-X2MXyHWA"], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$12$1B5Qew83bAf23V7P8UKmTuY6QEipWP899NYdVgbkBG/1BQi8XPeyq"], ["updated_at", "2024-05-20 18:08:14.517981"], ["id", 1]]
---
  def update
    @user = User.find_by(password_reset_token: params[:token])
    if @user.nil? || @user.password_reset_sent_at < 24.hours.ago
      redirect_to new_password_reset_path, alert: 'Password reset link is invalid or expired.'
    elsif @user.update(password_params)