api/app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:email].to_s.strip.downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "diehlstx@gmail.com"], ["LIMIT", 1]]