api/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."slug" = $1 LIMIT $2  [["slug", "123"], ["LIMIT", 1]]
---
  def set_user
    @user = User.find_by(slug: params[:id])